{"title":"Stencil - A Compiler for Web Components - Stencil","description":"Stencil has a number of add-ons that you can use with the build process.","url":"/docs/introduction","contributors":["jthoms1","adamdbradley","mlynch","kevinports"],"lastUpdated":"2020-05-06T21:50:26Z","headings":[{"id":"stencil-a-compiler-for-web-components-and-high-performance-web-apps","level":1,"text":"Stencil: A Compiler for Web Components and High Performance Web Apps"},{"id":"why-stencil","level":2,"text":"Why Stencil?"}],"srcPath":"./src/docs/introduction/why-stencil.md","hypertext":["div",null,["h1",{"id":"stencil-a-compiler-for-web-components-and-high-performance-web-apps"},"\n  \n  Stencil: A Compiler for Web Components and High Performance Web Apps\n  \n"],"\n",["p",null,"Stencil is a compiler that generates Web Components (more specifically, Custom Elements) and builds high performance web apps. Stencil combines the best concepts of the most popular frameworks into a simple build-time tool."],"\n",["p",null,"Stencil takes features such as"],"\n",["ul",null,"\n",["li",null,"Virtual DOM"],"\n",["li",null,"Async rendering (inspired by React Fiber)"],"\n",["li",null,"Reactive data-binding"],"\n",["li",null,"TypeScript"],"\n",["li",null,"JSX"],"\n",["li",null,"Static Site Generation (SSG)"],"\n"],"\n",["p",null,"and then generates standards-based Web Components and web apps with these features baked in."],"\n",["p",null,"Since Stencil generates standards-compliant web components, they can work with many popular frameworks right out of the box, and can be used without a framework because they are just web components. Stencil also enables a number of key capabilities on top of Web Components, in particular, prerendering, and objects-as-properties (instead of just strings)."],"\n",["p",null,"Compared to using Custom Elements directly, Stencil provides extra APIs that makes writing fast components simpler. APIs like Virtual DOM, JSX, and async rendering make fast, powerful components easy to create, while still maintaining 100% compatibility with Web Components."],"\n",["p",null,"The developer experience is also tuned, and comes with live reload and a small dev server baked in to the compiler."],"\n",["p",null,"But Stencil can also be used to build high performance web apps, offering advanced features such as Static Site Generation and powerful caching."],"\n\n",["h2",{"id":"why-stencil"},"\n  ",["a",{"class":"heading-link","href":"#why-stencil"},["app-icon",{"name":"link"}],"\n  Why Stencil?\n  "],"\n"],"\n",["p",null,"Stencil was created by the ",["a",{"href":"http://ionicframework.com/"},"Ionic Framework"]," team to help build faster, more capable components that worked across all major frameworks."],"\n",["p",null,"While Ionic primarily targeted Cordova apps, the emergence of Progressive Web Apps as a rapidly growing target for web developers demanded a different approach to web app development performance. With Ionic's classic use of traditional frameworks and bundling techniques, the team was struggling to meet latency and code size demands for Progressive Web Apps that ran equally well on fast and slow networks, across a diversity of platforms and devices."],"\n",["p",null,"Additionally, framework fragmentation had created a web development interoperability nightmare, where components built for one framework didn't work with another framework."],"\n",["p",null,"Web Components offered a solution to both problems, pushing more work to the browser for better performance, and targeting a standards-based component model that all frameworks could use."],"\n",["p",null,"However, Web Components by themselves weren't enough. Building fast web apps required innovations that were previously locked up inside of traditional web frameworks. Stencil was built to pull these features out of traditional frameworks and bring them to the fast emerging Web Component standard."]]}