{"title":"Stencil for Design Systems - Stencil","description":"Stencil for Design Systems","url":"/docs/stencil-for-design-systems","contributors":["dotNetkow","perrygovier","adamdbradley"],"lastUpdated":"2020-07-23T15:09:57Z","headings":[{"id":"using-stencil-to-build-a-design-system","level":1,"text":"Using Stencil to Build a Design System"},{"id":"the-importance-of-open-web-standards","level":2,"text":"The importance of open web standards"},{"id":"how-to-get-started","level":2,"text":"How to Get Started"}],"srcPath":"./src/docs/design-systems/stencil-for-design-systems.md","hypertext":["div",null,["h1",{"id":"using-stencil-to-build-a-design-system"},"\n  \n  Using Stencil to Build a Design System\n  \n"],"\n",["p",null,"There’s a lot that goes into creating amazing UI components. Performance, accessibility, cross-platform capabilities, and user experience (not only of the UI component itself but how it fits into the entire design system) all must be considered."],"\n",["p",null,"These aspects take real effort to do well."],"\n",["p",null,"Enter Stencil, a robust and highly extensible tool for building design systems. With its intentionally minimalistic tooling and API footprint, it’s simple to incorporate into your existing development workflows. It brings substantial performance out of the box by leveraging a tiny runtime. Most importantly, all UI components built with Stencil are based 100% on open web standards."],"\n\n",["h2",{"id":"the-importance-of-open-web-standards"},"\n  ",["a",{"class":"heading-link","href":"#the-importance-of-open-web-standards"},["app-icon",{"name":"link"}],"\n  The importance of open web standards\n  "],"\n"],"\n",["p",null,"By using the web components standard, supported in all modern browsers, Stencil-built UI components offer many distinct advantages for use in a design system, namely:"],"\n",["ul",null,"\n",["li",null,"They work on any platform or device"],"\n",["li",null,"They work with any front-end framework, so they can easily be used across teams and projects using different tech stacks"],"\n",["li",null,"They facilitate the creation of one company-wide code implementation instead of one per framework or platform"],"\n"],"\n",["p",null,"Learn more about why web components are ideal for design systems in ",["a",{"href":"https://blog.ionicframework.com/5-reasons-web-components-are-perfect-for-design-systems/"},"this blog post"],"."],"\n\n",["h2",{"id":"how-to-get-started"},"\n  ",["a",{"class":"heading-link","href":"#how-to-get-started"},["app-icon",{"name":"link"}],"\n  How to Get Started\n  "],"\n"],"\n",["p",null,"Stencil’s out-the-box features will help you build your own library of universal UI components that will work across platforms, devices, and front-end frameworks. Review the documentation on this site to get started."]]}